Revit 2027 API
SharedParameterElement.ShouldHideWhenNoValue Method
 Indicates whether the parameter should be hidden from the properties palette if it has no value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShouldHideWhenNoValue()
Public Function ShouldHideWhenNoValue As Boolean
public:
bool ShouldHideWhenNoValue()
member ShouldHideWhenNoValue : unit -> bool
Return Value
Boolean
See Also
Reference
SharedParameterElement Class
Autodesk.Revit.DB Namespace